FactExtractorFactory/test/data/openvista/problems-multiples-7.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><CareRecord_QUPC_IN043200UV01Message xmlns="urn:hl7-org:v3" xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon"><response><id extension="179f64d7-67b0-3fd8-96bc-201e6edd4fc9"/><creationTime value="20110125205829.031-0800"/><interactionId extension="PRPA_IN900300UV02"/><processingCode code="P"/><processingModeCode code="R"/><acceptAckCode code="RCV"/><receiver typeCode="RCV"><device determinerCode="INSTANCE"><id root="2.16.840.1.113883.3.200"/><telecom value="http://localhost:8080/NhinConnect/CommonDataLayerService"/></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE"><id root="2.16.840.1.113883.3.200"/></device></sender><controlActProcess moodCode="EVN" classCode="CACT"><code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="CS" code="TE304001UV01"/><priorityCode code="R"/><subject typeCode="SUBJ"><registrationEvent moodCode="EVN" classCode="REG"><statusCode code="completed"/><custodian typeCode="CST"><assignedEntity classCode="ASSIGNED"><id assigningAuthorityName="OpenVista" root="2.16.840.1.113883.3.274"/></assignedEntity></custodian><subject2 typeCode="SUBJ"><careProvisionEvent moodCode="EVN" classCode="ENC"><recordTarget typeCode="RCT"><patient classCode="PAT"><id extension="7" root="2.16.840.1.113883.3.200"/><statusCode code="normal"/><patientPerson determinerCode="INSTANCE" classCode="PSN"><name use="L"><family>PATIENT</family><given>PHARMACY</given></name><administrativeGenderCode displayName="FEMALE" code="F"/><birthTime value="19750115000000-0800"/></patientPerson></patient></recordTarget><pertinentInformation3 contextConductionInd="true" contextControlCode="OP" typeCode="PERT"><sequenceNumber value="1"/><observation moodCode="EVN" classCode="OBS"><templateId root="2.16.840.1.113883.3.88.11.83.6"/><id extension="6"/><code displayName="Drug Allergy" codeSystemName="SNOMED CT" codeSystem="2.16.840.1.113883.6.96" code="416098002"/><effectiveTime value="20090402073000-0700"/><sourceOf typeCode="MFST"><substanceAdministration moodCode="EVN" classCode="SBADM"><consumable typeCode="CSM"><administerableMaterial classCode="ADMM"><administerableMaterial determinerCode="INSTANCE" classCode="MMAT"><code displayName="ASA/BUTALBITAL/CAFFEINE" code="UNK"/><desc>ASA/BUTALBITAL/CAFFEINE</desc></administerableMaterial></administerableMaterial></consumable></substanceAdministration></sourceOf><sourceOf typeCode="MFST"><observation moodCode="EVN" classCode="OBS"><templateId root="2.16.840.1.113883.10.20.1.54"/><text>ITCHING</text></observation></sourceOf><sourceOf typeCode="MFST"><observation moodCode="EVN" classCode="OBS"><templateId root="2.16.840.1.113883.10.20.1.54"/><text>WATERING EYES;RASH</text></observation></sourceOf></observation></pertinentInformation3></careProvisionEvent></subject2></registrationEvent></subject><queryAck><queryId extension="20090920011010.005"/><statusCode code="deliveredResponse"/><queryResponseCode code="OK"/><resultTotalQuantity value="1"/></queryAck></controlActProcess></response></CareRecord_QUPC_IN043200UV01Message></S:Body></S:Envelope>